[
  {
    "index": 1,
    "races": [
      {
        "name": "Dwarf"
      },
      {
        "name": "Hill Dwarf"
      },
      {
        "name": "Elf"
      },
      {
        "name": "High Elf"
      },
      {
        "name": "Gnome"
      },
      {
        "name": "Rock Gnome"
      },
      {
        "name": "Half-Elf"
      },
      {
        "name": "Half-Orc"
      }
    ],
    "name": "Darkvision",
    "desc": [
      "You have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You cannot discern color in darkness, only shades of gray."
    ]
  },
  {
    "index": 2,
    "races": [
      {
        "name": "Dwarf"
      },
      { "name": "Hill Dwarf" }
    ],
    "name": "Dwarven Resilience",
    "desc": [
      "You have advantage on saving throws against poison, and you have resistance against poison damage."
    ]
  },
  {
    "index": 3,
    "races": [
      {
        "name": "Dwarf"
      },
      { "name": "Hill Dwarf" }
    ],
    "name": "Dwarven Combat Training",
    "desc": [
      "You have proficiency with the battleaxe, handaxe, light hammer, and warhammer."
    ]
  },
  {
    "index": 4,
    "races": [
      {
        "name": "Dwarf"
      },
      { "name": "Hill Dwarf" }
    ],
    "name": "Stonecunning",
    "desc": [
      "Whenever you make an Intelligence (History) check related to the origin of stonework, you are considered proficient in the History skill and add double your proficiency bonus to the check, instead of your normal proficiency bonus."
    ]
  },
  {
    "index": 5,
    "races": [
      {
        "name": "Hill Dwarf"
      }
    ],
    "name": "Dwarven Toughness",
    "desc": [
      "Your hit point maximum increases by 1, and it increases by 1 every time you gain a level."
    ]
  },
  {
    "index": 6,
    "races": [
      {
        "name": "Elf"
      },
      { "name": "High Elf" }
    ],
    "name": "Keen Senses",
    "desc": ["You have proficiency in the Perception skill."]
  },
  {
    "index": 7,
    "races": [
      {
        "name": "Elf"
      },
      { "name": "High Elf" },
      {
        "name": "Half-Elf"
      }
    ],
    "name": "Fey Ancestry",
    "desc": [
      "You have advantage on saving throws against being charmed, and magic cannot put you to sleep."
    ]
  },
  {
    "index": 8,
    "races": [
      {
        "name": "Elf"
      },
      { "name": "High Elf" }
    ],
    "name": "Trance",
    "desc": [
      "Elves do not need to sleep. Instead, they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is \"trance.\") While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting this way, you gain the same benefit that a human does from 8 hours of sleep."
    ]
  },
  {
    "index": 9,
    "races": [
      {
        "name": "Elf"
      },
      { "name": "High Elf" }
    ],
    "name": "Elf Weapon Training",
    "desc": [
      "You have proficiency with the longsword, shortsword, shortbow, and longbow."
    ]
  },
  {
    "index": 10,
    "races": [
      {
        "name": "High Elf"
      }
    ],
    "name": "High Elf Cantrip",
    "desc": [
      "You know one cantrip of your choice form the wizard spell list. Intelligence is your spellcasting ability for it."
    ]
  },
  {
    "index": 11,
    "races": [
      {
        "name": "High Elf"
      }
    ],
    "name": "Extra Language",
    "desc": [
      "You can speak, read, and write one extra language of your choice."
    ]
  },
  {
    "index": 12,
    "races": [
      {
        "name": "Halfling"
      },
      { "name": "Lightfoot Halfling" }
    ],
    "name": "Lucky",
    "desc": [
      "When you roll a 1 on the d20 for an attack roll, ability check, or saving throw, you can reroll the die and must use the new roll."
    ]
  },
  {
    "index": 13,
    "races": [
      {
        "name": "Halfling"
      },
      { "name": "Lightfoot Halfling" }
    ],
    "name": "Brave",
    "desc": ["You have advantage on saving throw against being frightened."]
  },
  {
    "index": 14,
    "races": [
      {
        "name": "Halfling"
      },
      { "name": "Lightfoot Halfling" }
    ],
    "name": "Halfling Nimbleness",
    "desc": [
      "You can move through the space of any creature that is of a size larger than yours."
    ]
  },
  {
    "index": 15,
    "races": [
      {
        "name": "Lightfoot Halfling"
      }
    ],
    "name": "Naturally Stealthy",
    "desc": [
      "You can attempt to hide even when you are obscured only by a creature that is at least one size larger than you."
    ]
  },
  {
    "index": 16,
    "races": [
      {
        "name": "Dragonborn"
      }
    ],
    "name": "Draconic Ancestry",
    "desc": [
      "You have draconic ancestry. Choose one type of dragon from the Draconic Ancestry table. Your breath weapon and damage resistance are determined by the dragon type, as shown in the table."
    ]
  },
  {
    "index": 17,
    "races": [
      {
        "name": "Dragonborn"
      }
    ],
    "name": "Breath Weapon",
    "desc": [
      "You can use your action to exhale destructive energy. Your draconic ancestry determines the size, shape, and damage type of the exhalation.",
      "When you use your breath weapon, each creature in the area of the exhalation must make a saving throw, the type of which is determined by your draconic ancestry. The DC for this saving throw equals 8 + your Constitution modifier + your proficiency bonus. A creature takes 2d6 damage on a failed save, and half as much damage on a successful one. The damage increases to 2d6 at 6th level, 3d6 at 11th level, and 5d6 at 16th level.",
      "After you use your breath weapon, you cannot use it again until you complete a short or long rest."
    ]
  },
  {
    "index": 18,
    "races": [
      {
        "name": "Dragonborn"
      }
    ],
    "name": "Damage Resistance",
    "desc": [
      "You have resistance to the damage type associated with your draconic ancestry."
    ]
  },
  {
    "index": 19,
    "races": [
      {
        "name": "Gnome"
      },
      { "name": "Rock Gnome" }
    ],
    "name": "Gnome Cunning",
    "desc": [
      "You have advantage on all Intelligence, Wisdom, and Charisma saving throws against magic."
    ]
  },
  {
    "index": 20,
    "races": [
      {
        "name": "Rock Gnome"
      }
    ],
    "name": "Artificer's Lore",
    "desc": [
      "Whenever you make an Intelligence (History) check related to magic items, alchemical objects, or technological devices, you can add twice your proficiency bonus, instead of any proficiency bonus you normally apply."
    ]
  },
  {
    "index": 21,
    "races": [
      {
        "name": "Rock Gnome"
      }
    ],
    "name": "Tinker",
    "desc": [
      "You have proficiency with artisan's tools (tinker's tools). Using those tools, you can spend 1 hour and 10 gp worth of materials to construct a Tiny clockwork device (AC 5, 1 hp). The device ceases to function after 24 hours (unless you spend 1 hour repairing it to keep the device functioning), or when you use your action to dismantle it; at that time, you can reclaim the materials used to create it. You can have up to three such devices active at a time.",
      "When you create a device, choose one of the following options:",
      "Clockwork Toy: This toy is a clockwork animal, monster, or person, such as a frog, mouse, bird, dragon, or soldier. When placed on the ground, the toy moves 5 feet across the ground on each of your turns in a random direction. It makes noises as appropriate to the creature it represents.",
      "Fire Starter: The device produces a miniature flame, which you can use to light a candle, torch, or campfire. Using the device requires your action.",
      "Music Box: When opened, this music box plays a single song at a moderate volume. The box stops playing when it reaches the song's end or when it is closed."
    ]
  },
  {
    "index": 22,
    "races": [
      {
        "name": "Half-Elf"
      }
    ],
    "name": "Skill Versatility",
    "desc": ["You gain proficiency in two skills of your choice."]
  },
  {
    "index": 23,
    "races": [
      {
        "name": "Half-Orc"
      }
    ],
    "name": "Menacing",
    "desc": ["You gain proficiency in the Intimidation skill."]
  },
  {
    "index": 24,
    "races": [
      {
        "name": "Half-Orc"
      }
    ],
    "name": "Relentless Endurance",
    "desc": [
      "When you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. you cannot use this feature again until you finish a long rest."
    ]
  },
  {
    "index": 25,
    "races": [
      {
        "name": "Half-Orc"
      }
    ],
    "name": "Savage Attacks",
    "desc": [
      "When you score a critical hit with a melee weapon attack, you can roll one of the weapon's damage dice one additional time and add it to the extra damage of the critical hit."
    ]
  },
  {
    "index": 26,
    "races": [
      {
        "name": "Tiefling"
      }
    ],
    "name": "Hellish Resistance",
    "desc": ["You have resistance to fire damage."]
  },
  {
    "index": 27,
    "races": [
      {
        "name": "Tiefling"
      }
    ],
    "name": "Internal Legacy",
    "desc": [
      "You know the thaumaturgy cantrip. When you reach 3rd level, you can cast the hellish rebuke spell as a 2nd-level spell once with this trait and regain the ability to do so when you finish a long rest. When you reach 5h level, you can cast the darkness spell once with this trait and regain the ability to do so when you finish a long rest. Charisma is your spellcasting ability for these spells."
    ]
  }
]
