[
  {
    "index": 1,
    "name": "Abjuration",
    "desc": "Abjuration spells are protective in nature, though some of them have aggressive uses. They create magical barriers, negate harmful effects, harm trespassers, or banish creatures to other planes of existence.",
    "url": "http://www.dnd5eapi.co/api/magic-schools/1"
  },
  {
    "index": 2,
    "name": "Conjuration",
    "desc": "Conjuration spells involve the transportation of objects and creatures from one location to another. Some spells summon creatures or objects to the caster's side, whereas others allow the caster to teleport to another location. Some conjurations create objects or effects out of nothing.",
    "url": "http://www.dnd5eapi.co/api/magic-schools/2"
  },
  {
    "index": 3,
    "name": "Divination",
    "desc": "Divination spells reveal information, whether in the form of secrets long forgotten, glimpses of the future, the locations of hidden things, the truth behind illusions, or visions of distant people or places.",
    "url": "http://www.dnd5eapi.co/api/magic-schools/3"
  },
  {
    "index": 4,
    "name": "Enchantment",
    "desc": "Enchantment spells affect the minds of others, influencing or controlling their behavior. Such spells can make enemies see the caster as a friend, force creatures to take a course of action, or even control another creature like a puppet.",
    "url": "http://www.dnd5eapi.co/api/magic-schools/4"
  },
  {
    "index": 5,
    "name": "Evocation",
    "desc": "Evocation spells manipulate magical energy to produce a desired effect. Some call up blasts of fire or lightning. Others channel positive energy to heal wounds.",
    "url": "http://www.dnd5eapi.co/api/magic-schools/5"
  },
  {
    "index": 6,
    "name": "Illusion",
    "desc": "Illusion spells deceive the senses or minds of others. They cause people to see things that are not there, to miss things that are there, to hear phantom noises, or to remember things that never happened. Some illusions create phantom images that any creature can see, but the most insidious illusions plant an image directly in the mind of a creature.",
    "url": "http://www.dnd5eapi.co/api/magic-schools/6"
  },
  {
    "index": 7,
    "name": "Necromancy",
    "desc": "Necromancy spells manipulate the energies of life and death. Such spells can grant an extra reserve of life force, drain the life energy from another creature, create the undead, or even bring the dead back to life.",
    "url": "http://www.dnd5eapi.co/api/magic-schools/7"
  },
  {
    "index": 8,
    "name": "Transmutation",
    "desc": "Transmutation spells change the properties of a creature, object, or environment. They might turn an enemy into a harmless creature, bolster the strength of an ally, make an object move at the caster's command, or enhance a creature's innate healing abilities to rapidly recover from injury.",
    "url": "http://www.dnd5eapi.co/api/magic-schools/8"
  }
]
