[
  {
    "index": 1,
    "class": {
      "url": "http://www.dnd5eapi.co/api/classes/2",
      "name": "Bard"
    },
    "level": 1,
    "spellcasting_ability": {
      "url": "http://www.dnd5eapi.co/api/ability-scores/6",
      "name": "CHA"
    },
    "info": [
      {
        "name": "Cantrips",
        "desc": [
          "You know two cantrips of your choice from the bard spell list. You learn additional bard cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Bard table."
        ]
      },
      {
        "name": "Spell Slots",
        "desc": [
          "The Bard table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.",
          "For example, if you know the 1st-level spell cure wounds and have a 1st-level and a 2nd-level spell slot available, you can cast cure wounds using either slot."
        ]
      },
      {
        "name": "Spells Known of 1st Level and Higher",
        "desc": [
          "You know four 1st-level spells of your choice from the bard spell list.",
          "The Spells Known column of the Bard table shows when you learn more bard spells of your choice.",
          "Each of these spells must be of a level for which you have spell slots, as shown on the table. For instance, when you reach 3rd level in this class, you can learn one new spell of 1st or 2nd level.",
          "Additionally, when you gain a level in this class, you can choose one of the bard spells you know and replace it with another spell from the bard spell list, which also must be of a level for which you have spell slots."
        ]
      },
      {
        "name": "Spellcasting Ability",
        "desc": [
          "Charisma is your spellcasting ability for your bard spells. Your magic comes from the heart and soul you pour into the performance of your music or oration. You use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a bard spell you cast and when making an attack roll with one.",
          "Spell save DC = 8 + your proficiency bonus + your Charisma modifier.",
          "Spell attack modifier = your proficiency bonus + your Charisma modifier."
        ]
      },
      {
        "name": "Ritual Casting",
        "desc": [
          "You can cast any bard spell you know as a ritual if that spell has the ritual tag."
        ]
      },
      {
        "name": "Spellcasting Focus",
        "desc": [
          "You can use a musical instrument (see Equipment) as a spellcasting focus for your bard spells."
        ]
      }
    ],
    "url": "http://www.dnd5eapi.co/api/spellcasting/1"
  },
  {
    "index": 2,
    "class": {
      "url": "http://www.dnd5eapi.co/api/classes/3",
      "name": "Cleric"
    },
    "level": 1,
    "spellcasting_ability": {
      "url": "http://www.dnd5eapi.co/api/ability-scores/5",
      "name": "WIS"
    },
    "info": [
      {
        "name": "Cantrips",
        "desc": [
          "At 1st level, you know three cantrips of your choice from the cleric spell list. You learn additional cleric cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Cleric table."
        ]
      },
      {
        "name": "Preparing and Casting Spells",
        "desc": [
          "The Cleric table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.",
          "You prepare the list of cleric spells that are available for you to cast, choosing from the cleric spell list. When you do so, choose a number of cleric spells equal to your Wisdom modifier + your cleric level (minimum of one spell). The spells must be of a level for which you have spell slots.",
          "For example, if you are a 3rd-level cleric, you have four 1st-level and two 2nd-level spell slots. With a Wisdom of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell cure wounds, you can cast it using a 1st-level or 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells.",
          "You can change your list of prepared spells when you finish a long rest. Preparing a new list of cleric spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list."
        ]
      },
      {
        "name": "Spellcasting Ability",
        "desc": [
          "Wisdom is your spellcasting ability for your cleric spells. The power of your spells comes from your devotion to your deity. You use your Wisdom whenever a cleric spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a cleric spell you cast and when making an attack roll with one.",
          "Spell save DC = 8 + your proficiency bonus + your Wisdom modifier",
          "Spell attack modifier = your proficiency bonus + your Wisdom modifier"
        ]
      },
      {
        "name": "Ritual Casting",
        "desc": [
          "You can cast a cleric spell as a ritual if that spell has the ritual tag and you have the spell prepared."
        ]
      },
      {
        "name": "Spellcasting Focus",
        "desc": [
          "You can use a holy symbol (see Equipment) as a spellcasting focus for your cleric spells."
        ]
      }
    ],
    "url": "http://www.dnd5eapi.co/api/spellcasting/2"
  },
  {
    "index": 3,
    "class": {
      "url": "http://www.dnd5eapi.co/api/classes/4",
      "name": "Druid"
    },
    "level": 1,
    "spellcasting_ability": {
      "url": "http://www.dnd5eapi.co/api/ability-scores/5",
      "name": "WIS"
    },
    "info": [
      {
        "name": "Cantrips",
        "desc": [
          "At 1st level, you know two cantrips of your choice from the druid spell list. You learn additional druid cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Druid table."
        ]
      },
      {
        "name": "Preparing and Casting Spells",
        "desc": [
          "The Druid table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these druid spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.",
          "You prepare the list of druid spells that are available for you to cast, choosing from the druid spell list. When you do so, choose a number of druid spells equal to your Wisdom modifier + your druid level (minimum of one spell). The spells must be of a level for which you have spell slots.",
          "For example, if you are a 3rd-level druid, you have four 1st-level and two 2nd-level spell slots. With a Wisdom of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell cure wounds, you can cast it using a 1st-level or 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells.",
          "You can also change your list of prepared spells when you finish a long rest. Preparing a new list of druid spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list."
        ]
      },
      {
        "name": "Spellcasting Ability",
        "desc": [
          "Wisdom is your spellcasting ability for your druid spells, since your magic draws upon your devotion and attunement to nature. You use your Wisdom whenever a spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a druid spell you cast and when making an attack roll with one."
        ]
      },
      {
        "name": "Ritual Casting",
        "desc": [
          "You can cast a druid spell as a ritual if that spell has the ritual tag and you have the spell prepared."
        ]
      },
      {
        "name": "Spellcasting Focus",
        "desc": [
          "You can use a druidic focus (see chapter 5, \"Equipment\") as a spellcasting focus for your druid spells."
        ]
      }
    ],
    "url": "http://www.dnd5eapi.co/api/spellcasting/3"
  },
  {
    "index": 4,
    "class": {
      "url": "http://www.dnd5eapi.co/api/classes/7",
      "name": "Paladin"
    },
    "level": 2,
    "spellcasting_ability": {
      "url": "http://www.dnd5eapi.co/api/ability-scores/6",
      "name": "CHA"
    },
    "info": [
      {
        "name": "Preparing and Casting Spells",
        "desc": [
          "The Paladin table shows how many spell slots you have to cast your spells. To cast one of your paladin spells of 1st level or higher, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.",
          "You prepare the list of paladin spells that are available for you to cast, choosing from the paladin spell list. When you do so, choose a number of paladin spells equal to your Charisma modifier + half your paladin level, rounded down (minimum of one spell). The spells must be of a level for which you have spell slots.",
          "For example, if you are a 5th-level paladin, you have four 1st-level and two 2nd-level spell slots. With a Charisma of 14, your list of prepared spells can include four spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell cure wounds, you can cast it using a 1st-level or a 2nd- level slot. Casting the spell doesn't remove it from your list of prepared spells.",
          "You can change your list of prepared spells when you finish a long rest. Preparing a new list of paladin spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list."
        ]
      },
      {
        "name": "Spellcasting Ability",
        "desc": [
          "Charisma is your spellcasting ability for your paladin spells, since their power derives from the strength of your convictions. You use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a paladin spell you cast and when making an attack roll with one."
        ]
      },
      {
        "name": "Spellcasting Focus",
        "desc": [
          "You can use a holy symbol as a spellcasting focus for your paladin spells."
        ]
      }
    ],
    "url": "http://www.dnd5eapi.co/api/spellcasting/4"
  },
  {
    "index": 5,
    "class": {
      "url": "http://www.dnd5eapi.co/api/classes/8",
      "name": "Ranger"
    },
    "level": 2,
    "spellcasting_ability": {
      "url": "http://www.dnd5eapi.co/api/ability-scores/5",
      "name": "WIS"
    },
    "info": [
      {
        "name": "Spell Slots",
        "desc": [
          "The Ranger table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.",
          "For example, if you know the 1st-level spell animal friendship and have a 1st-level and a 2nd-level spell slot available, you can cast animal friendship using either slot."
        ]
      },
      {
        "name": "Spells Known of 1st Level and Higher",
        "desc": [
          "You know two 1st-level spells of your choice from the ranger spell list.",
          "The Spells Known column of the Ranger table shows when you learn more ranger spells of your choice. Each of these spells must be of a level for which you have spell slots. For instance, when you reach 5th level in this class, you can learn one new spell of 1st or 2nd level.",
          "Additionally, when you gain a level in this class, you can choose one of the ranger spells you know and replace it with another spell from the ranger spell list, which also must be of a level for which you have spell slots."
        ]
      },
      {
        "name": "Spellcasting Ability",
        "desc": [
          "Wisdom is your spellcasting ability for your ranger spells, since your magic draws on your attunement to nature. You use your Wisdom whenever a spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a ranger spell you cast and when making an attack roll with one."
        ]
      }
    ],
    "url": "http://www.dnd5eapi.co/api/spellcasting/5"
  },
  {
    "index": 6,
    "class": {
      "url": "http://www.dnd5eapi.co/api/classes/10",
      "name": "Sorcerer"
    },
    "level": 1,
    "spellcasting_ability": {
      "url": "http://www.dnd5eapi.co/api/ability-scores/6",
      "name": "CHA"
    },
    "info": [
      {
        "name": "Cantrips",
        "desc": [
          "At 1st level, you know four cantrips of your choice from the sorcerer spell list. You learn additional sorcerer cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Sorcerer table."
        ]
      },
      {
        "name": "Spell Slots",
        "desc": [
          "The Sorcerer table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these sorcerer spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.",
          "For example, if you know the 1st-level spell burning hands and have a 1st-level and a 2nd-level spell slot available, you can cast burning hands using either slot."
        ]
      },
      {
        "name": "Spells Known of 1st Level and Higher",
        "desc": [
          "You know two 1st-level spells of your choice from the sorcerer spell list.",
          "The Spells Known column of the Sorcerer table shows when you learn more sorcerer spells of your choice. Each of these spells must be of a level for which you have spell slots. For instance, when you reach 3rd level in this class, you can learn one new spell of 1st or 2nd level. ",
          "Additionally, when you gain a level in this class, you can choose one of the sorcerer spells you know and replace it with another spell from the sorcerer spell list, which also must be of a level for which you have spell slots."
        ]
      },
      {
        "name": "Spellcasting Ability",
        "desc": [
          "Charisma is your spellcasting ability for your sorcerer spells, since the power of your magic relies on your ability to project your will into the world. You use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a sorcerer spell you cast and when making an attack roll with one."
        ]
      },
      {
        "name": "Spellcasting Focus",
        "desc": [
          "You can use an arcane focus as a spellcasting focus for your sorcerer spells."
        ]
      }
    ],
    "url": "http://www.dnd5eapi.co/api/spellcasting/6"
  },
  {
    "index": 7,
    "class": {
      "url": "http://www.dnd5eapi.co/api/classes/11",
      "name": "Warlock"
    },
    "level": 1,
    "spellcasting_ability": {
      "url": "http://www.dnd5eapi.co/api/ability-scores/6",
      "name": "CHA"
    },
    "info": [
      {
        "name": "Cantrips",
        "desc": [
          "You know two cantrips of your choice from the warlock spell list. You learn additional warlock cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Warlock table."
        ]
      },
      {
        "name": "Spell Slots",
        "desc": [
          "The Warlock table shows how many spell slots you have. The table also shows what the level of those slots is; all of your spell slots are the same level. To cast one of your warlock spells of 1st level or higher, you must expend a spell slot. You regain all expended spell slots when you finish a short or long rest.",
          "For example, when you are 5th level, you have two 3rd-level spell slots. To cast the 1st-level spell thunderwave, you must spend one of those slots, and you cast it as a 3rd-level spell."
        ]
      },
      {
        "name": "Spells Known of 1st Level and Higher",
        "desc": [
          "At 1st level, you know two 1st-level spells of your choice from the warlock spell list.",
          "The Spells Known column of the Warlock table shows when you learn more warlock spells of your choice of 1st level and higher. ",
          "A spell you choose must be of a level no higher than what's shown in the table's Slot Level column for your level. When you reach 6th level, for example, you learn a new warlock spell, which can be 1st, 2nd, or 3rd level.",
          "Additionally, when you gain a level in this class, you can choose one of the warlock spells you know and replace it with another spell from the warlock spell list, which also must be of a level for which you have spell slots."
        ]
      },
      {
        "name": "Spellcasting Ability",
        "desc": [
          "Charisma is your spellcasting ability for your warlock spells, so you use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a warlock spell you cast and when making an attack roll with one."
        ]
      },
      {
        "name": "Spellcasting Focus",
        "desc": [
          "You can use an arcane focus as a spellcasting focus for your warlock spells."
        ]
      }
    ],
    "url": "http://www.dnd5eapi.co/api/spellcasting/7"
  },
  {
    "index": 8,
    "class": {
      "url": "http://www.dnd5eapi.co/api/classes/12",
      "name": "Wizard"
    },
    "level": 1,
    "spellcasting_ability": {
      "url": "http://www.dnd5eapi.co/api/ability-scores/4",
      "name": "INT"
    },
    "info": [
      {
        "name": "Cantrips",
        "desc": [
          "At 1st level, you know three cantrips of your choice from the wizard spell list. You learn additional wizard cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Wizard table."
        ]
      },
      {
        "name": "Spellbook",
        "desc": [
          "At 1st level, you have a spellbook containing six 1st- level wizard spells of your choice. Your spellbook is the repository of the wizard spells you know, except your cantrips, which are fixed in your mind."
        ]
      },
      {
        "name": "Preparing and Casting Spells",
        "desc": [
          "The Wizard table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.",
          "You prepare the list of wizard spells that are available for you to cast. To do so, choose a number of wizard spells from your spellbook equal to your Intelligence modifier + your wizard level (minimum of one spell). The spells must be of a level for which you have spell slots.",
          "For example, if you're a 3rd-level wizard, you have four 1st-level and two 2nd-level spell slots. With an Intelligence of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination, chosen from your spellbook. If you prepare the 1st-level spell magic missile, you can cast it using a 1st-level or a 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells.",
          "You can change your list of prepared spells when you finish a long rest. Preparing a new list of wizard spells requires time spent studying your spellbook and memorizing the incantations and gestures you must make to cast the spell: at least 1 minute per spell level for each spell on your list."
        ]
      },
      {
        "name": "Spellcasting Ability",
        "desc": [
          "Intelligence is your spellcasting ability for your wizard spells, since you learn your spells through dedicated study and memorization. You use your Intelligence whenever a spell refers to your spellcasting ability. In addition, you use your Intelligence modifier when setting the saving throw DC for a wizard spell you cast and when making an attack roll with one."
        ]
      },
      {
        "name": "Ritual Casting",
        "desc": [
          "You can cast a wizard spell as a ritual if that spell has the ritual tag and you have the spell in your spellbook. You don't need to have the spell prepared."
        ]
      },
      {
        "name": "Spellcasting Focus",
        "desc": [
          "You can use an arcane focus as a spellcasting focus for your wizard spells."
        ]
      }
    ],
    "url": "http://www.dnd5eapi.co/api/spellcasting/8"
  }
]
