[
	{
		"index": "alert",
		"name": "Alert",
		"category": "origin",
		"prerequisites": [],
		"description": "You gain the following benefits.",
		"benefits": [
			{
				"name": "Initiative Proficiency",
				"description": "When you roll Initiative, you can add your Proficiency Bonus to the roll."
			},
			{
				"name": "Initiative Swap",
				"description": "Immediately after you roll Initiative, you can swap your Initiative with the Initiative of one willing ally in the same combat. You can’t make this swap if you or the ally has the Incapacitated condition."
			}
		],
		"url": "/api/2024/feats/alert"
	},
	{
		"index": "magic-initiate",
		"name": "Magic Initiate",
		"category": "origin",
		"prerequisites": [],
		"description":"You gain the following benefits.",
		"benefits": [
			{
				"name": "Two Cantrips",
				"description": "You learn two cantrips of your choice from the Cleric, Druid, or Wizard spell list. Intelligence, Wisdom, or Charisma is your spellcasting ability for this feat’s spells (choose when you select this feat)."
			},
			{
				"name": "Level 1 Spell",
				"description": "Choose a level 1 spell from the same list you selected for this feat’s cantrips. You always have that spell prepared. You can cast it once without a spell slot, and you regain the ability to cast it in that way when you finish a Long Rest. You can also cast the spell using any spell slots you have."
			},
			{
				"name": "Spell Change",
				"description": "Whenever you gain a new level, you can replace one of the spells you chose for this feat with a different spell of the same level from the chosen spell list."
			},
			{
				"name": "Repeatable",
				"description": "You can take this feat more than once, but you must choose a different spell list each time."
			}
		],
		"url": "/api/2024/feats/magic-initiate"
	},
	{
		"index": "savage-attacker",
		"name": "Savage Attacker",
		"category": "origin",
		"prerequisites": [],
		"description":"You’ve trained to deal particularly damaging strikes. Once per turn when you hit a target with a weapon, you can roll the weapon’s damage dice twice and use either roll against the target.",
		"benefits": [],
		"url": "/api/2024/feats/savage-attacker"
	},
	{
		"index": "skilled",
		"name": "Skilled",
		"category": "origin",
		"prerequisites": [],
		"description":"You gain proficiency in any combination of three skills or tools of your choice.",
		"benefits": [
			{
				"name": "Repeatable",
				"description": "You can take this feat more than once."
			}
		],
		"url": "/api/2024/feats/skilled"
	}
]