{
  "ammunitionName": "Munição",
  "ammunitionDesc1": "Você pode usar uma arma que tenha a propriedade munição para realizar um ataque à distância, apenas se possuir munição para disparar a arma. Cada vez que você atacar com a arma, você gasta uma peça de munição. Sacar a munição de uma aljava, bolsa, ou outro recipiente faz parte do ataque.",
  "ammunitionDesc2": "No fim da batalha, você pode recuperar metade de sua munição gasta, se tiver um minuto para procurar pelo campo de batalha. Recarregar uma arma de uma mão requer uma mão livre." ,
  "finesseName": "Acuidade",
  "finesseDesc1": "Quando realizar um ataque com uma arma com a propriedade acuidade, você pode escolher usar seu modificador de Força ou de Destreza para realizar a jogada de ataque e de dano. Você precisa usar o mesmo modificador para ambas as jogadas, ataque e dano",
  "heavyName": "Pesada",
  "heavyDesc1": "Criaturas pequenas têm desvantagem nas jogadas de ataque com estas armas. O tamanho e o peso de uma arma pesada tornam-na muito grande para ser empunhada eficientemente por criaturas Pequenas.",
  "lighName": "Leve",
  "lightDesc1": "Uma arma leve é pequena e de fácil manuseio, tornando-a ideal para usar quando você está combatendo com duas armas.",
  "loadingName": "Recarga",
  "loadingDesc1": "Devido o tempo necessário para recarregar essa arma, você pode disparar apenas uma peça de munição da arma quando usa uma ação, ação bônus, ou reação para disparar, não importando quantos ataques você possua.",
  "reachName": "Alcance",
  "reachDesc1": "Essa arma adiciona 1,5 metro ao seu alcance quando você a usa para atacar. Essa propriedade também determina seu alcance ao realizar ataques de oportunidade com uma arma de alcance.",
  "specialName": "Especial",
  "specialDesc1": "Uma arma com a propriedade especial possui regras diferenciadas que detalham seu uso, explicado na descrição da arma (veja \"Armas Especiais\" mais adiante).",
  "thrownName": "Arremesso",
  "thrownDesc1": "Se uma arma possuir a propriedade arremesso, você pode arremessar a arma para realizar um ataque à distância. Se essa arma for uma arma de ataque corpo-a-corpo, você usa o mesmo modificador de habilidade para as jogadas de ataque e dano que usaria para realizar um ataque corpo-a-corpo com a arma. Por exemplo, se você arremessar uma machadinha, ele usa seu modificador de Força, mas se arremessar uma adaga, você pode usar tanto seu modificador de Força quanto o de Destreza, pois a adaga possui a propriedade acuidade.",
  "twoHandedName": "Duas Mãos",
  "twoHandedDesc1": "Essa arma requer as duas mãos para ser usada. Essa propriedade só é relevante quando você ataca com a arma, não enquanto apenas a segura.",
  "versatileName": "Versátil",
  "versatileDesc1": "Essa arma pode ser usada com uma ou duas mãos. Um valor de dano aparece entre parênteses com a propriedade – é o dano da arma quando usada com as duas mãos para efetuar ataques corpo-a-corpo.",
  "monkName": "Monge",
  "monkDesc1": "Monges recebem uma série de benefícios enquanto desarmados ou empunhando apenas armas de monge enquanto não estiverem usando armaduras ou empunhando escudos."
}
