[
  {
      "index": "lawful-good",
      "name": "Lawful Good",
      "abbreviation": "LG",
      "description": "Lawful Good creatures endeavor to do the right thing as expected by society. Someone who fights injustice and protects the innocent without hesitation is probably Lawful Good.",
      "url": "/api/2024/alignments/lawful-good"
  },
  {
      "index": "neutral-good",
      "name": "Neutral Good",
      "abbreviation": "NG",
      "description": "Neutral Good creatures do the best they can, working within rules but not feeling bound by them. A kindly person who helps others according to their needs is probably Neutral Good.",
      "url": "/api/2024/alignments/neutral-good"
  },
  {
      "index": "chaotic-good",
      "name": "Chaotic Good",
      "abbreviation": "CG",
      "description": "Chaotic Good creatures act as their conscience directs with little regard for what others expect. A rebel who waylays a cruel baron's tax collectors and uses the stolen money to help the poor is probably Chaotic Good.",
      "url": "/api/2024/alignments/chaotic-good"
  },
  {
      "index": "lawful-neutral",
      "name": "Lawful Neutral",
      "abbreviation": "LN",
      "description": "Lawful Neutral individuals act in accordance with law, tradition, or personal codes. Someone who follows a disciplined rule of life—and isn't swayed either by the demands of those in need or by the temptations of evil—is probably Lawful Neutral.",
      "url": "/api/2024/alignments/lawful-neutral"
  },
  {
      "index": "neutral",
      "name": "Neutral",
      "abbreviation": "N",
      "description": "Neutral is the alignment of those who prefer to avoid moral questions and don't take sides, doing what seems best at the time. Someone who's bored by moral debate is probably Neutral.",
      "url": "/api/2024/alignments/neutral"
  },
  {
      "index": "chaotic-neutral",
      "name": "Chaotic Neutral",
      "abbreviation": "CN",
      "description": "Chaotic Neutral creatures follow their whims, valuing their personal freedom above all else. A scoundrel who wanders the land living by their wits is probably Chaotic Neutral.",
      "url": "/api/2024/alignments/chaotic-neutral"
  },
  {
      "index": "lawful-evil",
      "name": "Lawful Evil",
      "abbreviation": "LE",
      "description": "Lawful Evil creatures methodically take what they want within the limits of a code of tradition, loyalty, or order. An aristocrat exploiting citizens while scheming for power is probably Lawful Evil.",
      "url": "/api/2024/alignments/lawful-evil"
  },
  {
      "index": "neutral-evil",
      "name": "Neutral Evil",
      "abbreviation": "NE",
      "description": "Neutral Evil is the alignment of those who are untroubled by the harm they cause as they pursue their desires. A criminal who robs and murders as they please is probably Neutral Evil.",
      "url": "/api/2024/alignments/neutral-evil"
  },
  {
      "index": "chaotic-evil",
      "name": "Chaotic Evil",
      "abbreviation": "CE",
      "description": "Chaotic Evil creatures act with arbitrary violence, spurred by their hatred or bloodlust. A villain pursuing schemes of vengeance and havoc is probably Chaotic Evil.",
      "url": "/api/2024/alignments/chaotic-evil"
  },
  {
    "index": "unaligned",
    "name": "Unaligned",
    "abbreviation": "U",
    "description": "Most creatures that lack the capacity for rational thought don't have alignments; they are unaligned. Sharks are savage predators, for example, but they aren't evil; they are unaligned.",
    "url": "/api/2024/alignments/unaligned"
  }
]
