[
  {
    "index": "adamantine-armor",
    "name": "Adamantine Armor",
    "equipment_category": {
      "name": "Armor",
      "url": "/api/equipment-categories/armor"
    },
    "desc": [
      "Armor (medium or heavy, but not hide), uncommon",
      "This suit of armor is reinforced with adamantine, one of the hardest substances in existence. While you’re wearing it, any critical hit against you becomes a normal hit."
    ],
    "url": "/api/magic-items/adamantine-armor"
  },
  {
    "index": "ammunition",
    "name": "Ammunition, +1, +2, or +3",
    "equipment_category": {
      "name": "Weapon",
      "url": "/api/equipment-categories/weapon"
    },
    "desc": [
      "Weapon (any ammunition), uncommon (+1), rare (+2), or very rare (+3)",
      "You have a bonus to attack and damage rolls made with this piece of magic ammunition. The bonus is determined by the rarity of the ammunition. Once it hits a target, the ammunition is no longer magical."
    ],
    "url": "/api/magic-items/ammunition"
  },
  {
    "index": "amulet-of-health",
    "name": "Amulet of Health",
    "equipment_category": {
      "name": "Wondrous Item",
      "url": "/api/equipment-categories/wondrous-item"
    },
    "desc": [
      "Wondrous item, rare (requires attunement)",
      "Your Constitution score is 19 while you wear this amulet. It has no effect on you if your Constitution is already 19 or higher"
    ],
    "url": "/api/magic-items/amulet-of-health"
  },
  {
    "index": "amulet-of-proof-against-detection-and-location",
    "name": "Amulet of Proof against Detection and Location",
    "equipment_category": {
      "name": "Wondrous Item",
      "url": "/api/equipment-categories/wondrous-item"
    },
    "desc": ["String"],
    "url": "/api/magic-items/amulet-of-proof-against-detection-and-location"
  },
  {
    "index": "amulet-of-the-planes",
    "name": "Amulet of the Planes",
    "equipment_category": {
      "name": "Wondrous Item",
      "url": "/api/equipment-categories/wondrous-item"
    },
    "desc": [
      "Wondrous item, very rare (requires attunement)",
      "While wearing this amulet, you can use an action to name a location that you are familiar with on another plane of existence. Then make a DC 15 Intelligence check. On a successful check, you cast the plane shift spell. On a failure, you and each creature and object within 15 feet of you travel to a random destination. Roll a d100. On a 1–60, you travel to a random location on the plane you named. On a 61–100, you travel to a randomly determined plane of existence."
    ],
    "url": "/api/magic-items/amulet-of-the-planes"
  },
  {
    "index": "animated-shield",
    "name": "Animated Shield",
    "equipment_category": {
      "name": "Armor",
      "url": "/api/equipment-categories/armor"
    },
    "desc": [
      "Armor (shield), very rare (requires attunement)",
      "While holding this shield, you can speak its command word as a bonus action to cause it to animate. The shield leaps into the air and hovers in your space to protect you as if you were wielding it, leaving your hands free. The shield remains animated for 1 minute, until you use a bonus action to end this effect, or until you are incapacitated or die, at which point the shield falls to the ground or into your hand if you have one free."
    ],
    "url": "/api/magic-items/animated-shield"
  },
  {
    "index": "apparatus-of-the-crab",
    "name": "Apparatus of the Crab",
    "equipment_category": {
      "name": "Wondrous Item",
      "url": "/api/equipment-categories/wondrous-item"
    },
    "desc": [
      "Wondrous item, legendary",
      "This item first appears to be a Large sealed iron barrel weighing 500 pounds. The barrel has a hidden catch, which can be found with a successful DC 20 Intelligence (Investigation) check. Releasing the catch unlocks a hatch at one end of the barrel, allowing two Medium or smaller creatures to crawl inside. Ten levers are set in a row at the far end, each in a neutral position, able to move either up or down. When certain levers are used, the apparatus transforms to resemble a giant lobster.",
      "The apparatus of the Crab is a Large object with the following statistics:",
      "Armor Class: 20",
      "Hit Points: 200",
      "Speed: 30 ft., swim 30 ft. (or 0 ft. for both if the legs and tail aren’t extended)",
      "Damage Immunities: poison, psychic",
      "To be used as a vehicle, the apparatus requires one pilot. While the apparatus’s hatch is closed, the compartment is airtight and watertight. The compartment holds enough air for 10 hours of breathing, divided by the number of breathing creatures inside.",
      "The apparatus floats on water. It can also go underwater to a depth of 900 feet. Below that, the vehicle takes 2d6 bludgeoning damage per minute from pressure.",
      "A creature in the compartment can use an action to move as many as two of the apparatus’s levers up or down. After each use, a lever goes back to its neutral position. Each lever, from left to right, functions as shown in the Apparatus of the Crab Levers table.",
      "Apparatus of the Crab Levers",
      "| Lever | Up | Down |",
      "|---|---|---|",
      "| 1 | Legs and tail extend, allowing the apparatus to walk and swim. | Legs and tail retract, reducing the apparatus’s speed to 0 and making it unable to benefit from bonuses to speed. |",
      "| 2 | Forward window shutter opens. | Forward window shutter closes. |",
      "| 3 | Side window shutters open (two per side). | Side window shutters close (two per side). |",
      "| 4 | Two claws extend from the front sides of the apparatus. | The claws retract. |",
      "| 5 | Each extended claw makes the following melee weapon attack: +8 to hit, reach 5 ft., one target. Hit: 7 (2d6) bludgeoning damage. | Each extended claw makes the following melee weapon attack: +8 to hit, reach 5 ft., one target. Hit: The target is grappled (escape DC 15). |",
      "| 6 | The apparatus walks or swims forward. | The apparatus walks or swims backward. |",
      "| 7 | The apparatus turns 90 degrees left. | The apparatus turns 90 degrees right. |",
      "| 8 | Eyelike fixtures emit bright light in a 30-foot radius and dim light for an additional 30 feet. | The light turns off. |",
      "| 9 | The apparatus sinks as much as 20 feet in liquid. | The apparatus rises up to 20 feet in liquid. |",
      "| 10 | The rear hatch unseals and opens. |  The rear hatch closes and seals. |"
    ]
  },
  {
    "index": "armor",
    "name": "Armor, +1, +2, or +3",
    "equipment_category": {
      "name": "Armor",
      "url": "/api/equipment-categories/armor"
    },
    "desc": [
      "Armor (light, medium, or heavy), rare (+1), very rare (+2), or legendary (+3)",
      "You have a bonus to AC while wearing this armor. The bonus is determined by its rarity."
    ],
    "url": "/api/magic-items/armor"
  },
  {
    "index": "armor-of-invulnerability",
    "name": "Armor of Invulnerability",
    "equipment_category": {
      "name": "armor",
      "url": "/api/equipment-categories/armor"
    },
    "desc": [
      "Armor (plate), legendary (requires attunement)",
      "You have resistance to nonmagical damage while you wear this armor. Additionally, you can use an action to make yourself immune to nonmagical damage for 10 minutes or until you are no longer wearing the armor. Once this special action is used, it can’t be used again until the next dawn."
    ],
    "url": "/api/magic-items/armor-of-invulnerability"
  },
  {
    "index": "armor-of-resistance",
    "name": "Armor of Resistance",
    "equipment_category": {
      "name": "Armor",
      "url": "/api/equipment-categories/armor"
    },
    "desc": [
      "Armor (light, medium, or heavy), rare (requires attunement)",
      "You have resistance to one type of damage while you wear this armor. The GM chooses the type or determines it randomly from the options below.",
      "| d10 | Damage Type |",
      "|---|---|",
      "| 1 | Acid |",
      "| 2 | Cold |",
      "| 3 | Fire |",
      "| 4 | Force |",
      "| 5 | Lightning |",
      "| 6 | Necrotic |",
      "| 7 | Poison |",
      "| 8 | Psychic |",
      "| 9 | Radiant |",
      "| 10 | Thunder |"
    ],
    "url": "/api/magic-items/armor-of-resistance"
  },
  {
    "index": "armor-of-vulnerability",
    "name": "Armor of Vulnerability",
    "equipment_category": {
      "name": "Armor",
      "url": "/api/equipment-categories/armor"
    },
    "desc": [
      "Armor (plate), rare (requires attunement)",
      "While wearing this armor, you have resistance to  one of the following damage types: bludgeoning, piercing, or slashing. The GM chooses the type or determines it randomly.",
      "Curse. This armor is cursed, a fact that is revealed only when an identify spell is cast on the armor or you attune to it. Attuning to the armor curses you until you are targeted by the remove curse spell or similar magic; removing the armor fails to end the curse. While cursed, you have vulnerability to two of the three damage types associated with the armor (not the one to which it grants resistance)."
    ],
    "url": "/api/magic-items/armor-of-vulnerability"
  },
  {
    "index": "arrow-catching-shield",
    "name": "Arrow-Catching Shield",
    "equipment_category": {
      "name": "Armor",
      "url": "/api/equipment-categories/armor"
    },
    "desc": [
      "Armor (shield), rare (requires attunement)",
      "You gain a +2 bonus to AC against ranged attacks while you wield this shield. This bonus is in addition to the shield’s normal bonus to AC. In addition, whenever an attacker makes a ranged attack against a target within 5 feet of you, you can use your reaction to become the target of the attack instead."
    ],
    "url": "/api/magic-items/arrow-catching-shield"
  },
  {
    "index": "arrow-of-slaying",
    "name": "Arrow of Slaying",
    "equipment_category": {
      "name": "Weapon",
      "url": "/api/equipment-categories/weapon"
    },
    "desc": [
      "Weapon (arrow), very rare",
      "An arrow of slaying is a magic weapon meant to slay a particular kind of creature. Some are more focused than others; for example, there are both arrows of dragon slaying and arrows of blue dragon slaying. If a creature belonging to the type, race, or group associated with an arrow of slaying takes damage from the arrow, the creature must make a DC 17 Constitution saving throw, taking an extra 6d10 piercing damage on a failed save, or half as much extra damage on a successful one.",
      "Once an arrow of slaying deals its extra damage to a creature, it becomes a nonmagical arrow.",
      "Other types of magic ammunition of this kind exist, such as bolts of slaying meant for a crossbow, though arrows are most common."
    ],
    "url": "/api/magic-items/arrow-of-slaying"
  },
  {
    "index": "bag-of-beans",
    "name": "Bag of Beans",
    "equipment_category": {
      "name": "Wondrous Item",
      "url": "/api/equipment-categories/wondrous-item"
    },
    "desc": [
      "Wondrous item, rare",
      "Inside this heavy cloth bag are 3d4 dry beans. The bag weighs 1/2 pound plus 1/4 pound for each bean it contains.",
      "If you dump the bag’s contents out on the ground,  they explode in a 10-foot radius, extending from the beans. Each creature in the area, including you, must  make a DC 15 Dexterity saving throw, taking 5d4 fire  damage on a failed save, or half as much damage on  a successful one. The fire ignites flammable objects  in the area that aren’t being worn or carried.",
      "If you remove a bean from the bag, plant it in dirt  or sand, and then water it, the bean produces an  effect 1 minute later from the ground where it was  planted. The GM can choose an effect from the  following table, determine it randomly, or create an  effect.",
      "| d100 | Effect |",
      "|---|---|",
      "| 01 | 5d4 toadstools sprout. If a creature eats a toadstool, roll any die. On an odd roll, the eater must succeed on a DC 15 Constitution saving throw or take 5d6 poison damage and become poisoned for 1 hour. On an even roll, the eater gains 5d6 temporary hit points for 1 hour. |",
      "| 02-10 | A geyser erupts and spouts water, beer, berry juice, tea, vinegar, wine, or oil (GM’s choice) 30 feet into the air for 1d12 rounds. |",
      "| 11-20 | A treant sprouts. There’s a 50 percent chance that the treant is chaotic evil and attacks. |",
      "| 21-30 | An animate, immobile stone statue in your likeness rises. It makes verbal threats against you. If you leave it and others come near, it describes you as the most heinous of villains and directs the newcomers to find and attack you. If you are on the same plane of existence as the statue, it knows where you are. The statue becomes inanimate after 24 hours. |",
      "| 31-40 | A campfire with blue flames springs forth and burns for 24 hours (or until it is extinguished). |",
      "| 41-50 | 1d6 + 6 shriekers sprout |",
      "| 51-60 | 1d4 + 8 bright pink toads crawl forth. Whenever a toad is touched, it transforms into a Large or smaller monster of the GM’s choice. The monster remains for 1 minute, then disappears in a puff of bright pink smoke. |",
      "| 61-70 | A hungry bulette burrows up and attacks. |",
      "| 71-80 | A fruit tree grows. It has 1d10 + 20 fruit, 1d8 of which act as randomly determined magic potions, while one acts as an ingested poison of the GM’s choice. The tree vanishes after 1 hour. Picked fruit remains, retaining any magic for 30 days. |",
      "| 81-90 | A nest of 1d4 + 3 eggs springs up. Any creature that eats an egg must make a DC 20 Constitution saving throw. On a successful save, a creature permanently increases its lowest ability score by 1, randomly choosing among equally low scores. On a failed save, the creature takes 10d6 force damage from an internal magical explosion. |",
      "| 91-99 | A pyramid with a 60-foot-square base bursts upward. Inside is a sarcophagus containing a mummy lord. The pyramid is treated as the mummy lord’s lair, and its sarcophagus contains treasure of the GM’s choice. |",
      "| 100 | A giant beanstalk sprouts, growing to a height of the GM’s choice. The top leads where the GM chooses, such as to a great view, a cloud giant’s castle, or a different plane of existence. |"
    ],
    "url": "/api/magic-items/bag-of-beans"
  },
  {
    "index": "bag-of-devouring",
    "name": "Bag of Devouring",
    "equipment_category": {
      "name": "Wondrous Item",
      "url": "/api/equipment-categories/wondrous-item"
    },
    "desc": [
      "Wondrous item, very rare",
      "This bag superficially resembles a bag of holding but is a feeding orifice for a gigantic extradimensional creature. Turning the bag inside out closes the orifice.",
      "The extradimensional creature attached to the bag can sense whatever is placed inside the bag. Animal or vegetable matter placed wholly in the bag is devoured and lost forever. When part of a living creature is placed in the bag, as happens when someone reaches inside it, there is a 50 percent chance that the creature is pulled inside the bag. A creature inside the bag can use its action to try to escape with a successful DC 15 Strength check. Another creature can use its action to reach into the bag to pull a creature out, doing so with a successful DC 20 Strength check (provided it isn’t pulled inside the bag first). Any creature that starts its turn inside the bag is devoured, its body destroyed.",
      "Inanimate objects can be stored in the bag, which can hold a cubic foot of such material. However, once each day, the bag swallows any objects inside it and spits them out into another plane of existence. The GM determines the time and plane.",
      "If the bag is pierced or torn, it is destroyed, and anything contained within it is transported to a random location on the Astral Plane."
    ],
    "url": "/api/magic-items/bag-of-devouring"
  },
   {
    "index": "bag-of-holding",
    "name": "Bag of Holding",
    "equipment_category": {
      "name": "Wondrous Item",
      "url": "/api/equipment-categories/wondrous-item"
    },
    "desc": [
      "Wondrous	item,	uncommon",
      "This bag has an interior space considerably larger than its outside dimensions, roughly 2 feet in diameter at the mouth and 4 feet deep. The bag can hold up to 500 pounds, not exceeding a volume of 64 cubic feet. The bag weighs 15 pounds, regardless of its contents. Retrieving an item from the bag requires an action.",
      "If the bag is overloaded, pierced, or torn, it ruptures and is destroyed, and its contents are scattered in the Astral Plane. If the bag is turned inside out, its contents spill forth, unharmed, but the bag must be put right before it can be used again. Breathing creatures inside the bag can survive up to a number of minutes equal to 10 divided by the number of creatures (minimum 1 minute), after which time they begin to suffocate.",
      "Placing a bag of holding inside an extradimensional space created by a Handy Haversack, Portable Hole, or similar item instantly destroys both items and opens a gate to the Astral Plane. The gate originates where the one item was placed inside the other. Any creature within 10 feet of the gate is sucked through it to a random location on the Astral Plane. The gate then closes. The gate is one-way only and can't be reopened."
    ],
    "url": "/api/magic-items/bag-of-holding"
 },
  {
    "index": "bag-of-tricks",
    "name": "Bag of Tricks",
    "equipment_category": {
     "name": "Wondrous Item",
      "url": "/api/equipment-categories/wondrous-item"
    },
    "desc": [
      "Wondrous	item,	uncommon",
      "This ordinary bag, made from gray, rust, or tan cloth, appears empty. Reaching inside the bag, however, reveals the presence of a small, fuzzy object. The bag weighs 1/2 pound.",
      "You can use an action to pull the fuzzy object from the bag and throw it up to 20 feet. When the object lands, it transforms into a creature you determine by rolling a d8 and consulting the table that corresponds to the bag's color. The creature vanishes at the next dawn or when it is reduced to 0 Hit Points.",
      "The creature is friendly to you and your companions, and it acts on Your Turn. You can use a Bonus Action to Command how the creature moves and what action it takes on its next turn, or to give it general orders, such as to Attack your enemies. In the absence of such orders, the creature acts in a fashion appropriate to its Nature.",
      "Once three fuzzy Objects have been pulled from the bag, the bag can't be used again until the next dawn.",
      "Gray Bag:",
      "| d8 | Creature |",
      "|---|---|",
      "| 01 | Weasel |",
      "| 02 | Giant Rat |",
      "| 03 | Badger |",
      "| 04 | Boar |",
      "| 05 | Panther |",
      "| 06 | Giant Badger |",
      "| 07 | Dire Wolf |",
      "| 08 | Giant Elk |",
      "Rust Bag:",
      "| d8 | Creature |",
      "|---|---|",
      "| 01 | Rat |",
      "| 02 | Owl |",
      "| 03 | Mastiff |",
      "| 04 | Goat |",
      "| 05 | Giant Goat |",
      "| 06 | Giant Boar |",
      "| 07 | Lion |",
      "| 08 | Brown Bear |",
      "Tan Bag:",
      "| d8 | Creature |",
      "|---|---|",
      "| 01 | Jackal |",
      "| 02 | Ape |",
      "| 03 | Baboon |",
      "| 04 | Axe Beak |",
      "| 05 | Black Bear |",
      "| 06 | Giant Weasel |",
      "| 07 | Giant Hyena |",
      "| 08 | Tiger |"
    ],
    "url": "/api/magic-items/bag-of-tricks"
  },
  {
    "index": "bead-of-force",
    "name": "Bead of Force",
    "equipment_category": {
       "name": "Wondrous Item",
      "url": "/api/equipment-categories/wondrous-item"
    },
    "desc": [
      "Wondrous	item,	rare",
      "This small black Sphere measures 3/4 of an inch in diameter and weighs an ounce. Typically, 1d4 + 4 beads of force are found together.",
      "You can use an action to throw the bead up to 60 feet. The bead explodes on impact and is destroyed. Each creature within a 10-foot radius of where the bead landed must succeed on a DC 15 Dexterity saving throw or take 5d4 force damage. A Sphere of transparent force then encloses the area for 1 minute. Any creature that failed the save and is completely within the area is trapped inside this Sphere. Creatures that succeeded on the save, or are partially within the area, are pushed away from the center of the Sphere until they are no longer inside it. Only breathable air can pass through the sphere's wall. No Attack or other Effect can.",
      "An enclosed creature can use its action to push against the sphere's wall, moving the Sphere up to half the creature's walking speed. The Sphere can be picked up, and its magic causes it to weigh only 1 pound, regardless of the weight of creatures inside."
    ],
    "url": "/api/magic-items/bead-of-force"
  },
  {
    "index": "String",
    "name": "String",
    "equipment_category": {
      "name": "String",
      "url": "/api/equipment-categories/"
    },
    "desc": [
      "String"
    ],
    "url": "/api/magic-items/"
  }
]
