[
  {
    "index": "adamantine-armor",
    "name": "Adamantine Armor",
    "equipment_category": {
      "name": "Armor",
      "url": "/api/equipment-categories/armor"
    },
    "desc": [
      "Armor (medium or heavy, but not hide), uncommon",
      "This suit of armor is reinforced with adamantine, one of the hardest substances in existence. While you’re wearing it, any critical hit against you becomes a normal hit."
    ],
    "url": "/api/magic-items/adamantine-armor"
  },
  {
    "index": "ammunition",
    "name": "Ammunition, +1, +2, or +3",
    "equipment_category": {
      "name": "Weapon",
      "url": "/api/equipment-categories/weapon"
    },
    "desc": [
      "Weapon (any ammunition), uncommon (+1), rare (+2), or very rare (+3)",
      "You have a bonus to attack and damage rolls made with this piece of magic ammunition. The bonus is determined by the rarity of the ammunition. Once it hits a target, the ammunition is no longer magical."
    ],
    "url": "/api/magic-items/ammunition"
  },
  {
    "index": "amulet-of-health",
    "name": "Amulet of Health",
    "equipment_category": {
      "name": "Wondrous Item",
      "url": "/api/equipment-categories/wondrous-item"
    },
    "desc": [
      "Wondrous item, rare (requires attunement)",
      "Your Constitution score is 19 while you wear this amulet. It has no effect on you if your Constitution is already 19 or higher"
    ],
    "url": "/api/magic-items/amulet-of-health"
  },
  {
    "index": "amulet-of-proof-against-detection-and-location",
    "name": "Amulet of Proof against Detection and Location",
    "equipment_category": {
      "name": "Wondrous Item",
      "url": "/api/equipment-categories/wondrous-item"
    },
    "desc": ["String"],
    "url": "/api/magic-items/amulet-of-proof-against-detection-and-location"
  },
  {
    "index": "amulet-of-the-planes",
    "name": "Amulet of the Planes",
    "equipment_category": {
      "name": "Wondrous Item",
      "url": "/api/equipment-categories/wondrous-item"
    },
    "desc": [
      "Wondrous item, very rare (requires attunement)",
      "While wearing this amulet, you can use an action to name a location that you are familiar with on another plane of existence. Then make a DC 15 Intelligence check. On a successful check, you cast the plane shift spell. On a failure, you and each creature and object within 15 feet of you travel to a random destination. Roll a d100. On a 1–60, you travel to a random location on the plane you named. On a 61–100, you travel to a randomly determined plane of existence."
    ],
    "url": "/api/magic-items/amulet-of-the-planes"
  },
  {
    "index": "animated-shield",
    "name": "Animated Shield",
    "equipment_category": {
      "name": "Armor",
      "url": "/api/equipment-categories/armor"
    },
    "desc": [
      "Armor (shield), very rare (requires attunement)",
      "While holding this shield, you can speak its command word as a bonus action to cause it to animate. The shield leaps into the air and hovers in your space to protect you as if you were wielding it, leaving your hands free. The shield remains animated for 1 minute, until you use a bonus action to end this effect, or until you are incapacitated or die, at which point the shield falls to the ground or into your hand if you have one free."
    ],
    "url": "/api/magic-items/animated-shield"
  },
  {
    "index": "apparatus-of-the-crab",
    "name": "Apparatus of the Crab",
    "equipment_category": {
      "name": "Wondrous Item",
      "url": "/api/equipment-categories/wondrous-item"
    },
    "desc": [
      "Wondrous item, legendary",
      "This item first appears to be a Large sealed iron barrel weighing 500 pounds. The barrel has a hidden catch, which can be found with a successful DC 20 Intelligence (Investigation) check. Releasing the catch unlocks a hatch at one end of the barrel, allowing two Medium or smaller creatures to crawl inside. Ten levers are set in a row at the far end, each in a neutral position, able to move either up or down. When certain levers are used, the apparatus transforms to resemble a giant lobster.",
      "The apparatus of the Crab is a Large object with the following statistics:",
      "Armor Class: 20",
      "Hit Points: 200",
      "Speed: 30 ft., swim 30 ft. (or 0 ft. for both if the legs and tail aren’t extended)",
      "Damage Immunities: poison, psychic",
      "To be used as a vehicle, the apparatus requires one pilot. While the apparatus’s hatch is closed, the compartment is airtight and watertight. The compartment holds enough air for 10 hours of breathing, divided by the number of breathing creatures inside.",
      "The apparatus floats on water. It can also go underwater to a depth of 900 feet. Below that, the vehicle takes 2d6 bludgeoning damage per minute from pressure.",
      "A creature in the compartment can use an action to move as many as two of the apparatus’s levers up or down. After each use, a lever goes back to its neutral position. Each lever, from left to right, functions as shown in the Apparatus of the Crab Levers table.",
      "Apparatus of the Crab Levers",
      "| Lever | Up | Down |",
      "|---|---|---|",
      "| 1 | Legs and tail extend, allowing the apparatus to walk and swim. | Legs and tail retract, reducing the apparatus’s speed to 0 and making it unable to benefit from bonuses to speed. |",
      "| 2 | Forward window shutter opens. | Forward window shutter closes. |",
      "| 3 | Side window shutters open (two per side). | Side window shutters close (two per side). |",
      "| 4 | Two claws extend from the front sides of the apparatus. | The claws retract. |",
      "| 5 | Each extended claw makes the following melee weapon attack: +8 to hit, reach 5 ft., one target. Hit: 7 (2d6) bludgeoning damage. | Each extended claw makes the following melee weapon attack: +8 to hit, reach 5 ft., one target. Hit: The target is grappled (escape DC 15). |",
      "| 6 | The apparatus walks or swims forward. | The apparatus walks or swims backward. |",
      "| 7 | The apparatus turns 90 degrees left. | The apparatus turns 90 degrees right. |",
      "| 8 | Eyelike fixtures emit bright light in a 30-foot radius and dim light for an additional 30 feet. | The light turns off. |",
      "| 9 | The apparatus sinks as much as 20 feet in liquid. | The apparatus rises up to 20 feet in liquid. |",
      "| 10 | The rear hatch unseals and opens. |  The rear hatch closes and seals. |"
    ]
  },
  {
    "index": "armor",
    "name": "Armor, +1, +2, or +3",
    "equipment_category": {
      "name": "Armor",
      "url": "/api/equipment-categories/armor"
    },
    "desc": [
      "Armor (light, medium, or heavy), rare (+1), very rare (+2), or legendary (+3)",
      "You have a bonus to AC while wearing this armor. The bonus is determined by its rarity."
    ],
    "url": "/api/magic-items/armor"
  },
  {
    "index": "armor-of-invulnerability",
    "name": "Armor of Invulnerability",
    "equipment_category": {
      "name": "armor",
      "url": "/api/equipment-categories/armor"
    },
    "desc": [
      "Armor (plate), legendary (requires attunement)",
      "You have resistance to nonmagical damage while you wear this armor. Additionally, you can use an action to make yourself immune to nonmagical damage for 10 minutes or until you are no longer wearing the armor. Once this special action is used, it can’t be used again until the next dawn."
    ],
    "url": "/api/magic-items/armor-of-invulnerability"
  },
  {
    "index": "armor-of-resistance",
    "name": "Armor of Resistance",
    "equipment_category": {
      "name": "Armor",
      "url": "/api/equipment-categories/armor"
    },
    "desc": [
      "Armor (light, medium, or heavy), rare (requires attunement)",
      "You have resistance to one type of damage while you wear this armor. The GM chooses the type or determines it randomly from the options below.",
      "| d10 | Damage Type |",
      "|---|---|",
      "| 1 | Acid |",
      "| 2 | Cold |",
      "| 3 | Fire |",
      "| 4 | Force |",
      "| 5 | Lightning |",
      "| 6 | Necrotic |",
      "| 7 | Poison |",
      "| 8 | Psychic |",
      "| 9 | Radiant |",
      "| 10 | Thunder |"
    ],
    "url": "/api/magic-items/armor-of-resistance"
  },
  {
    "index": "String",
    "name": "String",
    "equipment_category": {
      "name": "String",
      "url": "/api/equipment-categories/"
    },
    "desc": ["String"],
    "url": "/api/magic-items/"
  }
]
